
&НаКлиенте
Процедура ЗагрузитьФайл(Команда)
	Оповещение  =  Новый ОписаниеОповещения("ОбработатьВыборФайла",ЭтотОбъект);
	НачатьПомещениеФайла(Оповещение,,,Истина,УникальныйИдентификатор);
КонецПроцедуры

&НаКлиенте
Процедура ОбработатьВыборФайла(Результат,Адрес,ВыбранноеИмяФайла,ДополнительныеПараметры) Экспорт
	Если Не Результат Тогда
 		Возврат; 
	КонецЕсли;
	ФайлФормы = Адрес;
	Объект.ПутьДоФайла = ВыбранноеИмяФайла;
	ФайлСИменем = Новый Файл(ВыбранноеИмяФайла);
	Объект.ИмяФайла = ФайлСИменем.Имя;
КонецПроцедуры 

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	Если ЭтоАдресВременногоХранилища(ФайлФормы) Тогда
		ТекущийОбъект.Файл = Новый ХранилищеЗначения(ПолучитьИзВременногоХранилища(ФайлФормы));
		ТекущийОбъект.Изменен = Истина;
	КонецЕсли; 
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Попытка
 	Объект.Автор = ПараметрыСеанса.ТекущийПользователь;	
 	Исключение
 		ТекстОшибки = ОписаниеОшибки();
 	КонецПопытки;
	ФайлФормы = ПолучитьНавигационнуюСсылку(Объект.Ссылка, "Файл"); 
КонецПроцедуры

&НаКлиенте
Процедура ЗавершениеОбратныйВызов(ОписаниеПомещенногоФайла, ДополнительныеПараметры) Экспорт	
	Если ОписаниеПомещенногоФайла = Неопределено Или ОписаниеПомещенногоФайла.ПомещениеФайлаОтменено Тогда
		Возврат;
	КонецЕсли;

	Объект.Наименование = ОписаниеПомещенногоФайла.СсылкаНаФайл.Имя;
	СсылкаНаДанныеФайла = ОписаниеПомещенногоФайла.Адрес;
	ЭтоКартинка = РаботаСФайламиКлиентСервер.ЭтоКартинка(Объект.Наименование);
	
	Если Не ЭтоКартинка Тогда
		Элементы.Предпросмотр.Видимость = Ложь;
	Иначе
		Элементы.Предпросмотр.Видимость = Истина;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ПрогрессОбратныйВызов(ПомещаемыйФайл, Помещено, ОтказОтПомещенияФайла, ДополнительныеПараметры) Экспорт
    Состояние("Файл " + ПомещаемыйФайл.Имя, Помещено, "Файл имеет размер " + ПомещаемыйФайл.Размер() + " байт", БиблиотекаКартинок.Документ);
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	ЭтоКартинка = РаботаСФайламиКлиентСервер.ЭтоКартинка(Объект.Наименование);

	Если ЭтоКартинка Тогда
		СсылкаНаДанныеФайла = ПолучитьНавигационнуюСсылку(Объект.Ссылка, "ФайлХранилище");
	Иначе
		Элементы.Предпросмотр.Видимость = Ложь;
	КонецЕсли;
КонецПроцедуры